/*インクルード***********************************************************/
#include "lpc13xx.h"
#include "gpio.h"
#include "vs-wrc103.h"
#include "ixbus.h"

/*マクロ***********************************************************/

/*グローバル変数***********************************************************/

/*メイン関数***********************************************************/
void main(void)
{
	//制御周期の設定[単位：Hz　範囲：30.0~]
	const unsigned short MainCycle = 60;
	Init(MainCycle);		//CPUの初期設定

	LED(3);
	while(getSW() != 1);	//ボタンが押されるまで待つ
	while(getSW() == 1);	//ボタンが離されるまで待つ

	//ループ
	while(1){
		//前進
		Mtr_Run_lv(10000,-10000,0,0,0,0);
		Wait(1000);

	}
}

